---
kind: enumMember
id: F:Autodesk.Revit.DB.Events.RevitAPIEventStatus.Cancelled
enum: Autodesk.Revit.DB.Events.RevitAPIEventStatus
source: html/a739b1f8-6b3b-a95b-b536-6e5d00d12e4e.htm
---
# Autodesk.Revit.DB.Events.RevitAPIEventStatus.Cancelled

The action that triggered this event was cancelled by an event handler from the pre-event for the action.